Revit 2026 API

# StairsGetStairsLandings Method

---

Returns all the stairs landing components in the stairs.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> GetStairsLandings()
```
```vb
Public Function GetStairsLandings As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ GetStairsLandings()
```
```fsharp
member GetStairsLandings : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementId The stairs landing components in the stairs.

#### Reference

Stairs Class

Autodesk.Revit.DB.Architecture Namespace